# Desafio 1: utilizando parâmetros do json_normalize

Ao normalizar o objeto JSON durante a aula passamos simplesmente `pd.json_normalize(<dados>)` mas o método json_normalize possui diversos parâmetros para trabalhar com estruturas de dados mais complexas.

Você recebeu a tarefa de normalizar o seguinte arquivo JSON chamado “informacoes.json” referente a algumas informações de identificação de um cliente.

In [1]:
import pandas as pd
from json import load

In [7]:
with open('in/informacoes.json') as f:
    json = load(f)

pd.json_normalize(json, record_path='enderecos', meta=['nome', 'idade'])

       tipo    rua  numero          cidade  nome idade
0      casa  Rua A     123       São Paulo  João    28
1  trabalho  Rua B     456  Rio de Janeiro  João    28

# Desafio 2: tratando os dados

Sua tarefa é realizar alguns tratamentos e deixar esse arquivo JSON como um Pandas DataFrame, sem dados vazios e com a tipagem das colunas de forma correta. Como isso pode ser feito?

In [16]:
with open('in/dados.json') as f:
    json = load(f)

dados = pd.json_normalize(json, record_path='pessoas').explode('telefones').reset_index(drop=True)
dados

    nome idade     telefones endereco.rua  endereco.numero endereco.cidade
0   João    25  11 1111-1111        Rua A              123       São Paulo
1   João    25  11 2222-2222        Rua A              123       São Paulo
2  Maria    30  21 3333-3333                           456  Rio de Janeiro

In [20]:
dados['idade'] = dados['idade'].astype(int)
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nome             3 non-null      object
 1   idade            3 non-null      int64
 2   telefones        3 non-null      object
 3   endereco.rua     3 non-null      object
 4   endereco.numero  3 non-null      int64
 5   endereco.cidade  3 non-null      object
dtypes: int64(2), object(4)
memory usage: 276.0+ bytes

In [25]:
subset_dados = dados.query('`endereco.rua` != ""').reset_index(drop=True).copy()
subset_dados

   nome  idade     telefones endereco.rua  endereco.numero endereco.cidade
0  João     25  11 1111-1111        Rua A              123       São Paulo
1  João     25  11 2222-2222        Rua A              123       São Paulo